{
  "architecture": [
    {
      "title": "AI-Native DevOps Framework",
      "description": "Zeus is designed to convert plain-language prompts into real, deployable blockchain infrastructure. It's not just a scripting tool—it’s an intelligent agent system for builders.",
      "icon": "BrainCircuit"
    },
    {
      "title": "Modular Agent System",
      "description": "At its core, Zeus uses specialized agents for planning, validating, and deploying. These agents can be extended with adapters for multiple chains like Solana and EVM, each with a configurable 'persona' to define its behavior and risk model.",
      "icon": "ToyBrick"
    },
    {
      "title": "From Prompt to Infrastructure",
      "description": "User intent, like “deploy a burnable Solana token,” is passed to a built-in LLM planner. This generates structured JSON blueprints which are then rendered into Dockerfiles, deployment scripts, and even markdown documentation.",
      "icon": "TerminalSquare"
    },
    {
      "title": "Local-First Philosophy",
      "description": "Your data and operations stay on your machine. Zeus runs 100% locally with no remote AI calls or cloud dependencies, and can even be used offline after the initial setup.",
      "icon": "Laptop"
    },
    {
      "title": "Wallet Risk Engine",
      "description": "Before a deployment goes live, Zeus can audit a wallet via RPC and score its risk based on past on-chain behavior. Includes built-in support for Solana transaction indexing and local SQLite caching.",
      "icon": "Shield"
    },
    {
      "title": "zk-Audit Layer (Planned)",
      "description": "A forward-looking feature to attach zero-knowledge attestations to each deployment, providing cryptographic receipts for your infrastructure without revealing sensitive details.",
      "icon": "Lock"
    }
  ],
  "roadmap": [
    {
      "quarter": "Q2 2025",
      "title": "Multi-Chain Support",
      "description": "Extend deployment capabilities beyond EVM to chains like Solana and Polkadot."
    },
    {
      "quarter": "Q3 2025",
      "title": "Plugin Architecture",
      "description": "Enable developers to build and share custom plugins to extend Zeus's core functionality."
    },
    {
      "quarter": "Later",
      "title": "AI-Powered Audits",
      "description": "Integrate automated smart contract auditing powered by advanced AI models."
    }
  ]
}
